app/views/administrator/product_categories/new.html.erb

													<div class="col-md-10">
														 <%= f.select :product_category_id , ProductCategory.all.collect {|category| [category.name, category.id ]}, class: "form-control" %>
---
SELECT "product_categories".* FROM "product_categories"