app/views/product_categories/blocks/_products_list.html.erb

SELECT "products".* FROM "products" WHERE "products"."product_category_id" = ?  [["product_category_id", 2]]
---
<% @i = 0 %>
<% @product_category.products.each do |product| %>