app/controllers/administrator/product_categories_controller.rb

SELECT "product_categories".* FROM "product_categories"
---
	def index
		@product_categories = ProductCategory.all

SELECT  "product_categories".* FROM "product_categories" WHERE "product_categories"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		@product_category = ProductCategory.find(params[:id])

INSERT INTO "product_categories" ("name", "product_category_id", "description", "meta_title", "meta_description", "meta_keywords", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product_category = ProductCategory.new(product_category_params)

    respond_to do |format|
      if @product_category.save

UPDATE "product_categories" SET "product_category_id" = ?, "avatar_file_name" = ?, "avatar_content_type" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "product_categories"."id" = ?
---
  def update
    respond_to do |format|
      if @product_category.update(product_category_params)

DELETE FROM "product_categories" WHERE "product_categories"."id" = ?  [["id", 16]]
---
  def destroy
    @product_category.destroy

SELECT  "product_categories".* FROM "product_categories" WHERE "product_categories"."id" = ? LIMIT 1  [["id", 16]]
---
  def set_product_category
      @product_category = ProductCategory.find(params[:id])