app/controllers/product_categories_controller.rb

    def set_product_category
      @product_category = ProductCategory.find(params[:id])
---
SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."product_category_id" = ?  [["product_category_id", 1]]